{
    "meta": {
        "description": "A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving its clients from across various business verticals and we believe in providing comprehensive solutions to clients in meeting the challenges of complying with the evolving business Accounting and Commercial Law parameters. We are committed to providing unmatched quality services in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas.",
        "keywords": "Accountant, Chartered Accountant, Tax Consultant, VAT Consultant, Accountancy, Bookkeeping, Quickbooks, Tally, Audit",
        "author": "A.Sen & Co. - www.asen.co.in"
    },
    "about_company": {
        "about": "A Sen & Co Chartered Accountants was established in September 2015 as a sole proprietary firm by CA Anjan Sen in Laketown , Kolkata. After 40 years of service experience as a CA in Indian MNCs both in manufacturing and service sector, we wanted to impart the expertise gathered to the prospective clients, especially to the SMEs and non commercial organization. With the progress in economic legislations in India, formal accounting and reporting is becoming all pervading. The consolidation of Indirect Taxes as one nation one tax, the simplification of Direct Taxes and recent amendments to Companies Act makes it mandatory for organizations to keep proper books with proper internal control and reporting system in place. The submission of returns with the statutory authorities is all getting digitized at its best.  Regular transactions are moving away from Cash and are getting done though the Banking system in  paperless yet secured environment.  With this backdrop Accounting and preparation of Final Accounts and Tax returns cannot remain only a yearend ritual. Moreover awareness that accounting is a tool for management information and decision making is gaining ground even at the bottom of the pyramid. With this perspective our main focus is to build appropriate accounting, internal control and MIS systems for the prospective clients so that with growth they can have robust foundations both for external reporting , filing of returns as well as reliable  internal decision support system.",
        "services": [
            "Complete solutions for structuring of accounting and internal control systems with both desktop based as well as cloud based Accounting software",
            "Regular updating of accounts and preparation of Financial Statements.",
            "Evaluation and implementation of Internal Financial Control systems of the organization",
            "Statutory Audits and Tax Audits",
            "Filing of Returns to Tax authorities",
            "Fund management"
        ]
    },
    "about_propreitor_anjan_sen": "CA Anjan Sen had built up his career in Finance department of major Indian MNCs till his retirement spanning from 1980 to 2015 Starting in the manufacturing sector like Tata Motors, Rallies India, Philips India, he mainly worked in developing the financial systems and implementing the computerization during the 70s and 80s as and accountant. It covered Costing, Budgeting, Accounting, Financial Reporting, MIS and Consolidation architectures from the branch to corporate level. In 1991 he moved to Tata Consultancy Services, finance department. Besides heading the Finance of Eastern region from Kolkata, he was also directly involved in transforming the accounting structure from a single user based desktop bookkeeping of early 90s to the current level of 20’s web based ERP cutting across various verticals, segments and geographies. In 2010 he moved to Mumbai Corporate Finance of the company as the Global Coordinator for Internal Audit, to coordinate the function of overseeing legal and internal policy compliances as well as testing the internal control implication in all the geographies and departments of the organization. He played the pioneering role in implementing the Internal Financial Control as required by the Indian Financial Reporting. A companywide automated Compliance System was also developed based on self assessment and reporting. He ultimately started building up the foundation for developing the companywide Internal Control cutting across all departments in line with COSO and SOX. The company now as an IT giant has attained global standard so far as its internal control mechanism is concerned. After retirement in 2015, he formed his own CA firm, A. Sen & Co., Chartered Accountant, based out of Kolkata. Assignments mainly include building up proper accounting structure and maintaining the same in SME organizations. It is pertinent in light GST roll out in India."
}