{
    "meta": {
        "description": "A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving its clients from across various business verticals and we believe in providing comprehensive solutions to clients in meeting the challenges of complying with the evolving business Accounting and Commercial Law parameters. We are committed to providing unmatched quality services in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas.",
        "keywords": "Accountant, Chartered Accountant, Tax Consultant, VAT Consultant, Accountancy, Bookkeeping, Quickbooks, Tally, Audit",
        "author": "A.Sen & Co. - www.asen.co.in"
    },
    "about_company": {
        "p1": " A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving its clients from across various business verticals and we believe in providing comprehensive solutions to clients in meeting the challenges of complying with the evolving business Accounting and Commercial Law parameters. We are committed to providing unmatched quality services in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas. clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law",
        "p2": "A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving its clients from across various business verticals and we believe in providing comprehensive solutions to clients in meeting the challenges of complying with the evolving business Accounting and Commercial Law parameters. We are committed to providing unmatched quality services in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas. clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law"
    },
    "about_propreitor_anjan_sen": "Anjan Sen is GREAT!!! A. Sen & Co is a Chartered Accountant firm based in Kolkata that is serving its clients from across various business verticals and we believe in providing comprehensive solutions to clients in meeting the challenges of complying with the evolving business Accounting and Commercial Law parameters. We are committed to providing unmatched quality services in a time-bound manner and believe in building long term associations with the clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law, management consultancy, and other allied areas. clientele. We have been rendering a multitude of services under one roof, especially in the field of back office management services, audit and assurance, direct and indirect taxation, corporate law"
}